# Pokemon

### Introduction:

This time you will create the data.



### Step 1. load the data munging libraries

In [6]:
import pandas as pd
import numpy as np
from pandas import DataFrame

### Step 2. Create a data dictionary

In [7]:
raw_data = {"name": ['Bulbasaur', 'Charmander','Squirtle','Caterpie'],
            "evolution": ['Ivysaur','Charmeleon','Wartortle','Metapod'],
            "type": ['grass', 'fire', 'water', 'bug'],
            "hp": [45, 39, 44, 45],
            "pokedex": ['yes', 'no','yes','no']                        
            }

In [10]:
dict(raw_data)

{'name': ['Bulbasaur', 'Charmander', 'Squirtle', 'Caterpie'],
 'evolution': ['Ivysaur', 'Charmeleon', 'Wartortle', 'Metapod'],
 'type': ['grass', 'fire', 'water', 'bug'],
 'hp': [45, 39, 44, 45],
 'pokedex': ['yes', 'no', 'yes', 'no']}

### Step 3. Assign it to a variable called : pokemon & check top 5 rows

In [13]:
pokemon=raw_data
df=DataFrame(pokemon)
df.head(5)

         name   evolution   type  hp pokedex
0   Bulbasaur     Ivysaur  grass  45     yes
1  Charmander  Charmeleon   fire  39      no
2    Squirtle   Wartortle  water  44     yes
3    Caterpie     Metapod    bug  45      no

### Step 4. Ops...it seems the DataFrame columns are in alphabetical order. Place  the order of the columns as name, type, hp, evolution, pokedex

In [15]:
df = df[['name','type','hp','evolution','pokedex']]
df

         name   type  hp   evolution pokedex
0   Bulbasaur  grass  45     Ivysaur     yes
1  Charmander   fire  39  Charmeleon      no
2    Squirtle  water  44   Wartortle     yes
3    Caterpie    bug  45     Metapod      no

### Step 5. Add another column called place, and insert what you have in mind.

In [18]:
India=['Mumbai','Hyderabad','Assam','Madhya Pradesh']
df['place']=India
df

C:\Users\HP\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

         name   type  hp   evolution pokedex           place
0   Bulbasaur  grass  45     Ivysaur     yes          Mumbai
1  Charmander   fire  39  Charmeleon      no       Hyderabad
2    Squirtle  water  44   Wartortle     yes           Assam
3    Caterpie    bug  45     Metapod      no  Madhya Pradesh

### Step 6. Present the type of each column

In [20]:
df.dtypes

name         object
type         object
hp            int64
evolution    object
pokedex      object
place        object
dtype: object

### Step 7. Find Data structure details

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
name         4 non-null object
type         4 non-null object
hp           4 non-null int64
evolution    4 non-null object
pokedex      4 non-null object
place        4 non-null object
dtypes: int64(1), object(5)
memory usage: 320.0+ bytes

In [22]:
df.describe()

              hp
count   4.000000
mean   43.250000
std     2.872281
min    39.000000
25%    42.750000
50%    44.500000
75%    45.000000
max    45.000000

### Step 8. Find number of rows and column of the data

In [23]:
df.shape

(4, 6)